<!-- 1. Import Library -->
Pada Tahap ini kita akan import library yang dibutuhkan

In [3]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, StandardScaler

<!-- 2. Dowload dan Load Dataset -->
Mendowload Dataset dari Kaggle,
Lalu memasukkan dataset yang ingin diolah

In [62]:
df = pd.read_csv("data_cleaning_practice_dataset.csv")
print(df)
df.head()

       Name  Gender   Age       City Department     Salary               Email
0     Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1      Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2     Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3      Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4    Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
..      ...     ...   ...        ...        ...        ...                 ...
495    Zara  Female  56.0     quetta         IT        NaN    zara35@gmail.com
496   Usman    Male   NaN     Lahore      Sales  107909.74   usman20@gmail.com
497   Ahmed    Male  20.0  Islamabad      Sales        NaN   ahmed99@gmail.com
498   Ahmed  Female   NaN     Lahore         IT   82915.36   ahmed80@gmail.com
499   Tariq    Male   NaN  Islamabad    Finance  122337.81   tariq64@gmail.com

[500 rows x 7 columns]

     Name  Gender   Age     City Department     Salary               Email
0   Tariq    Male  47.0  Karachi     Sales   123609.72   tariq76@gmail.com
1    Hina  Female  26.0   Quetta         HR  125683.94    hina90@gmail.com
2   Usman    Male  36.0   lahore     Sales         NaN   usman71@gmail.com
3    Sana  Female  21.0   Quetta    Finance  147901.41    sana72@gmail.com
4  Ayesha    Male  40.0   lahore         HR  123880.80  ayesha25@gmail.com

<!-- 3. EDA -->

In [63]:
df.info()
df.describe(include='all')
df.isnull().sum()
df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        500 non-null    object
 1   Gender      500 non-null    object
 2   Age         252 non-null    float64
 3   City        500 non-null    object
 4   Department  500 non-null    object
 5   Salary      248 non-null    float64
 6   Email       500 non-null    object
dtypes: float64(2), object(5)
memory usage: 27.5+ KB

np.int64(0)

<!-- 4. Data Cleaning -->

<!-- Menghapus Duplikat -->

In [64]:
df = df.drop_duplicates()
print("\n=== Data Setelah Dihapus Duplikat ===")
print(df)

=== Data Setelah Dihapus Duplikat ===
       Name  Gender   Age       City Department     Salary               Email
0     Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1      Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2     Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3      Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4    Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
..      ...     ...   ...        ...        ...        ...                 ...
495    Zara  Female  56.0     quetta         IT        NaN    zara35@gmail.com
496   Usman    Male   NaN     Lahore      Sales  107909.74   usman20@gmail.com
497   Ahmed    Male  20.0  Islamabad      Sales        NaN   ahmed99@gmail.com
498   Ahmed  Female   NaN     Lahore         IT   82915.36   ahmed80@gmail.com
499   Tariq    Male   NaN  Islamabad    Finance  122337.81   tariq64@gmail.com

[500 rows x 7 columns]

<!-- Missing Value -->

In [ ]:

print(df)

    employee_id  department         age      gender monthly_salary  \
0             1    Finance           28           M           4500
1             2          IT          32      Female     tidak tahu
2             3          Hr  tidak tahu      FEMAEL             10
3             4      Mkting          25        male           3800
4             5     finance          29        Male           4700
5             6          IT       forty        Male           7200
6             7          HR          34      Female           5100
7             8          IT          23      Female           3900
8             9   Marketing          30      Female              ?
9            10     Finance          50  tidak tahu           8000
10           11          IT          27           M           4.4k
11           12          HR          31      Female           4950
13           14     Finance          26      Female           3600
14           15          IT          35        Male           6500
15           16          hr          29      female           4800
16           17  Marketing           42      Female           5600
17           18     FINANCE          33        male              5
18           19          IT          24      Female           4000
19           20          HR          37        Male           5400
20           21    Finance           28           M           4500
21           22          IT          27           M           4.4k

   experienc_year
0               2
1               5
2              11
3              80
4               3
5              12
6           seven
7               1
8               4
9          twenty
10              2
11     tidak tahu
13              1
14              9
15              3
16             12
17              3
18            one
19              9
20              2
21              2

<!-- Inconsisstance Format -->

In [ ]:
df =